"use client"

import TitleWithIcon from "@/components/ui/globals/TitleWithIcon";
import MenuQuestions from "./MenuQuestions";
import Question from "./Question";
import { useState } from "react";

export default function AskedQuestions() {
    const [activeIndex, setActiveIndex] = useState(0);
    return (
        <div className="mt-24">
            <div className="grid text-center justify-center">
                <div>

                    <TitleWithIcon
                        center
                        title={'ســـوالات متــــداول'}
                    />
                </div>
                <div>
                    <div className="opacity-50 mt-1.5">
                        سوالات را مطالعه کنید تا ابهام هایتان از بین برود.
                    </div>
                </div>
            </div>

            <div className="mt-8 justify-center">
                <MenuQuestions activeIndex={activeIndex} setActiveIndex={setActiveIndex} />
            </div>

            <div className={`mt-12 max-w-[700px] mx-auto ${activeIndex === false && 'FadeInAnimate'}`}>
                {
                    activeIndex === 4 &&
                    <>
                        <Question ques={'چگونه درآمدمان را نقد کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'1'} />
                        <Question ques={'چگونه سفارش را کنسل کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'2'} />
                        <Question ques={'چگونه گیفت کارت را فعال کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'3'} />
                        <Question ques={'چگونه خرید خود را از آمازون پیگیری کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'4'} />
                        <Question ques={'چگونه حساب های بین المللی به نام ما میشود؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'5'} />
                    </>
                }
                {
                    activeIndex === 1 &&
                    <>
                        <Question ques={'چگونه سفارش را کنسل کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'2'} />
                        <Question ques={'چگونه حساب های بین المللی به نام ما میشود؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'4'} />
                    </>
                }
                {
                    activeIndex === 2 &&
                    <>
                        <Question ques={'چگونه درآمدمان را نقد کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'1'} />
                        <Question ques={'چگونه حساب های بین المللی به نام ما میشود؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'5'} />

                    </>
                }
                {
                    activeIndex === 3 &&
                    <>

                        <Question ques={'چگونه گیفت کارت را فعال کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'3'} />
                        <Question ques={'چگونه خرید خود را از آمازون پیگیری کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'4'} />

                    </>
                }
                {
                    activeIndex === 0 &&
                    <>
                        <Question ques={'چگونه درآمدمان را نقد کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'1'} />
                        <Question ques={'چگونه سفارش را کنسل کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'2'} />
                        <Question ques={'چگونه گیفت کارت را فعال کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'3'} />
                    </>
                }
            </div>
        </div>
    );
}