'use client';

import Link from 'next/link';
import styles from './Content.module.css'


export default function Content() {
    return (
        <div className={`text-[#464646] text-base ${styles.content}`}>
            <p className='mb-6'>
                به وبسایت اول کارت خوش آمدید.
            </p>
            <p>
                ما مفتخریم که به عنوان همراه شما در مسیر،خدماتی ایمن، سریع و مطمئن ارائه دهیم.
            </p>
            <p className=''>
                لطفا ً پیش از استفاده از خدمات، این قوانین و مقررات را به دقت مطالعه فرمایید. رعایت این شرایط نهتنها به حفظ حقوق شما و
                سایر کاربران کمک میکند، بلکه باعث بهبود کیفیت خدمات ما نیز خواهد شد. ثبتنام و استفاده از خدمات این وبسایت به
                منزله پذیرش این مقررات است. در صورت وجود هرگونه پرسش یا ابهام، تیم پشتیبانی ما همواره آماده پاسخگویی به شما
                عزیزان خواهد بود. همچنین در صورت داشتن سوال یا ابهام قبل از تماس با پشتیبانان ما میتوانید از برگه <Link href={'/faq'} className='text-blue-custom'> سوالات متداول </Link>
                برای برطرف کردن سواالت خود استفاده کنید.
            </p>
            <p>
                با احترام،
            </p>
            <p className='text-blue-custom'>
                اول کارت
            </p>


            <ol className="custom-counter font-medium">
                <li>
                    <h2>
                        تعاریف و اصطالحات:
                    </h2>
                    <p>
                        در این بخش، مفاهیم و اصطالحاتی که در قوانین و مقررات استفاده از خدمات بهکار رفتهاند، تعریف میشوند تا کاربران درک
                        بهتری از شرایط و نحوه استفاده از خدمات داشته باشند.
                    </p>
                    <ol className="custom-counter">

                        <li>
                            <h3>
                                کاربر (مشتری):
                            </h3>
                            <p>
                                "کاربر" یا "مشتری" به هر شخص حقیقی یا حقوقی اطالق میشود که از خدمات این وبسایت استفاده میکند. این خدمات
                                شامل نقد کردن درآمد دالری، خرید گیفت کارت، پرداختهای بین المللی و سایر خدمات ارائهشده در پلتفرم ما میشود.

                            </p>
                        </li>

                        <li>
                            <h3>
                                ارائهدهنده خدمات:
                            </h3>

                            <p>
                                مجموعه اول کارت به عنوان ارائهدهنده خدمات مالی و واسطهگری بین کاربران و پلتفرمهای بین المللی فعالیت میکند.
                                تمامی خدمات ارائهشده مطابق با قوانین داخلی و بین المللی بوده و این وبسایت متعهد به حفظ امنیت و حریم خصوصی
                                کاربران است.
                            </p>
                        </li>

                        <li>
                            <h3>
                                خدمات ارائهشده:
                            </h3>
                            <p>

                                خدمات این وبسایت شامل موارد زیر است:
                                <ul>
                                    <li>
                                        خرید گیفت کارت: ارائه انواع گیفت کارتهای معتبر از جمله آمازون، اپل، گوگلپلی، پلیاستیشن و...
                                    </li>
                                    <li>
                                        پرداختهای بین المللی: انجام پرداخت در وبسایت های خارجی برای خرید کالا، سرویسهای نرمافزاری، دورههای
                                        آموزشی و سایر خدمات
                                    </li>
                                    <li>
                                        خرید کالا از وبسایت های خارجی: کمک به خرید و ارسال کالا از سایتهای معتبر بین المللی
                                    </li>
                                </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                حساب کاربری:
                            </h3>
                            <p>

                                "حساب کاربری" به پنل اختصاصی هر کاربر در وبسایت گفته میشود که از طریق آن میتواند خدمات را دریافت کند. کاربران
                                موظفاند اطالعات صحیح و واقعی در هنگام ثبتنام ارائه دهند و از اطالعات ورود خود بهدرستی محافظت کنند.
                            </p>
                        </li>
                        <li>
                            <h3>
                                احراز هویت:
                            </h3>
                            <p>

                                "احراز هویت" فرآیندی است که در آن کاربران برای استفاده از برخی خدمات (مانند نقد کردن درآمد دالری) ملزم به ارائه مدارک
                                شناسایی و تأیید هویت خود هستند. این فرآیند برای افزایش امنیت تراکنشها و جلوگیری از فعالیتهای غیرقانونی انجام
                                میشود.
                            </p>
                        </li>
                        <li>
                            <h3>
                                کارمزد:
                            </h3>
                            <p>

                                "کارمزد" مبلغی است که بابت ارائه خدمات از کاربران دریافت میشود. میزان کارمزد بسته به نوع خدمت (نقد کردن درآمد، خرید
                                گیفت کارت و...) متغیر بوده و در صفحه مربوط به هر خدمت مشخص شده است.
                            </p>
                        </li>
                        <li>
                            <h3>
                                تراکنش:
                            </h3>
                            <p>

                                "تراکنش" به هرگونه پرداخت، دریافت، یا انتقال وجه از طریق وبسایت گفته میشود. تمام تراکنشهای کاربران طبق قوانین
                                مالی داخلی و بین المللی بررسی و پردازش میشوند.
                            </p>
                        </li>
                        <li>
                            <h3>
                                نرخ تبدیل ارز:
                            </h3>
                            <p>

                                "نرخ تبدیل ارز" به میزان ارزش یک ارز در برابر ارز دیگر گفته میشود. نرخ تبدیل برای خدمات نقد کردن درآمد دالری بر اساس نرخ
                                روز بازار و سیاستهای مالی مجموعه تعیین میشود.
                            </p>
                        </li>
                        <li>
                            <h3>
                                حسابهای مقصد:
                            </h3>
                            <p>

                                "حساب مقصد" به حسابهای بانکی یا کیف پولهای الکترونیکی گفته میشود که کاربران درخواست واریز وجوه خود را به
                                آنها دارند. کاربران موظفاند اطالعات حساب مقصد را بهصورت صحیح وارد کنند، در غیر این صورت مسئولیت هرگونه اشتباه
                                بر عهده کاربر خواهد بود.
                            </p>
                        </li>
                        <li>
                            <h3>
                                قوانین و مقررات مالی داخلی و بین المللی:
                            </h3>
                            <p>

                                تمامی خدمات این وبسایت باید مطابق با قوانین بانک مرکزی ایران، قوانین ضد پولشویی و مقررات بین المللی انجام شود.
                                هرگونه فعالیت مشکوک یا مغایر با این قوانین، منجر به مسدود شدن حساب کاربری و ارجاع اطالعات به مراجع قانونی خواهد
                                شد.
                            </p>
                        </li>
                    </ol>
                </li>

                <li>
                    <h2>
                        شرایط عمومی استفاده از خدمات:
                    </h2>
                    <p>
                        در این بخش، شرایط کلی که کاربران هنگام استفاده از خدمات وبسایت باید رعایت کنند، مشخص میشود. این قوانین برای
                        حفظ امنیت تراکنشها، ایجاد شفافیت در خدمات و جلوگیری از سوءاستفادههای احتمالی تدوین شدهاند.
                    </p>
                    <ol className="custom-counter">
                        <li>
                            <h3>
                                حداقل سن مجاز برای استفاده از خدمات:
                            </h3>
                            <p>
                                استفاده از خدمات این وبسایت تنها برای افراد بالای۱۸سال مجاز است. کاربران زیر این سن برای استفاده از خدمات باید با
                                نظارت والدین یا قیم قانونی خود اقدام کنند. در صورت مشاهده ثبتنام افراد زیر سن قانونی، حساب آنها مسدود خواهد
                                شد.
                            </p>
                        </li>
                        <li>
                            <h3>
                                پذیرش قوانین توسط کاربران:
                            </h3>
                            <p>
                                با ثبتنام در وبسایت و استفاده از خدمات، کاربران بهطور کامل قوانین و مقررات را پذیرفتهاند و متعهد میشوند که از این
                                قوانین تبعیت کنند. این قوانین ممکن است بهمرورزمان بهروزرسانی شوند و کاربران موظفاند تغییرات جدید را مطالعه و
                                رعایت کنند.درصورت تغییر نسخه جدید قوانین و مقررات در همین برگه بروزرسانی خواهد شد.
                            </p>
                        </li>
                        <li>
                            <h3>
                                حق تغییر یا بهروزرسانی شرایط خدمات:
                            </h3>
                            <p>
                                اول کارتاین حق را دارد که هر زمان بنا به شرایط بازار، تغییرات قانونی یا سیاستهای داخلییا بین المللی، شرایط استفاده از
                                خدمات را تغییر دهد. تغییرات در قوانین از طریق وبسایت و ایمیل به اطالع کاربران خواهد رسید. ادامه استفاده از خدمات
                                پس از اعمال تغییرات به معنای پذیرش آنها است.
                            </p>
                        </li>
                        <li>
                            <h3>
                                مسئولیتهای کاربران:
                            </h3>
                                <p>
                                تمام کاربران متعهد میشوند که:
                            <ul>
                                <li>
                                    اطالعاتشخصیوهویتیخودرابهصورتصحیحودقیقواردکنند.
                                </li>
                                <li>
                                    ازخدماتوبسایتدرچارچوبقوانینایرانوبین المللیاستفادهکنند.
                                </li>
                                <li>
                                    درصورتتغییراطالعاتشخصی(مانندشمارهتلفنیاحساببانکی)آنرابهروزرسانیکنند.
                                </li>
                                <li>
                                    ازحسابکاربریخودبرایفعالیتهایمشکوکیاغیرقانونیاستفادهنکنند.
                                </li>
                                <li>
                                    اطالعاتحسابکاربریخودرادراختیارشخصدیگریقرارندهند.
                                </li>
                                <li>
                                    در صورت مشاهده هرگونه نقض قوانین یا سوءاستفاده از خدمات،مجموعه اول کارتمیتواند دسترسی کاربر را به
                                خدمات محدود یا مسدود کند.
                                </li>
                            </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                محدودیتهای استفاده از خدمات:
                            </h3>
                            <p>
                                <li>
                                    مجموعه اول کارتخدماتی را برای انجام پرداختهای بین المللی ارائه میدهد اما مسئولیتی در قبال استفاده
                                نادرست از این خدماتراندارد.
                                </li>
                                <li>
                                    پرداختهاییکهبرایخریدکالاهایاخدماتغیرقانونیانجامشوند،پردازشنخواهندشد.
                                </li>
                                <li>
                                    درصورتدرخواستبازپرداختوجهازسویبانکهایبین المللییامؤسساتمالی،کاربرملزمبهارائهتوضیحاتو
                                مستنداتالزمخواهدبود.
                                </li>
                                <li>
                                    اینوبسایتازارائهخدماتبهکشورهایتحتتحریمبین المللیمعذوراستوکاربرانبایدقوانینمرتبطرارعایت
                                کنند.
                                </li>
                            </p>
                        </li>
                        <li>
                            <h3>
                                ارتباطات رسمی بین کاربران و مجموعه:
                            </h3>
                            <p>
                                تنها راههای ارتباط رسمی با مجموعه شامل:
                                <ul>
                                <li>
                                    تیکت
                                </li>
                                <li>
                                    ایمیل رسمی برای مثال :Info@avalcard.com
                                </li>
                                <li>
                                    شمارههای تماس اعالمشده در وبسایت
                                </li>
                                <li>
                                    صفحات رسمی در شبکههای اجتماعی
                                </li>
                                </ul>
                                هرگونهپیام،ایمیلیادرخواستپشتیبانیخارجازاینمسیرها،بهعنوانارتباطرسمیشناختهنمیشود.
                                کاربرانموظفاندپیامهایارسالیازسویمجموعه(مانندایمیلهایاطالعرسانیوامنیتی)رامطالعهکنند.
                            </p>
                        </li>
                        <li>
                            <h3>
                                قوانین مربوط به امنیت حساب کاربری:
                            </h3>
                            <p>
                                <ul>
                                <li>
                                    هر کاربر مسئول حفظ امنیت نام کاربری و رمز عبور خود است.
                                </li>
                                <li>
                                    درصورتمشاهدهفعالیتمشکوکدرحسابکاربری،کاربرموظفاستًفوراموضوعرابهپشتیبانیاطالعدهد.
                                </li>
                                <li>
                                    اینوبسایتازپروتکلهایامنیتیپیشرفتهبرایحفاظتازدادههایکاربراناستفادهمیکند،امادرصورتافشای
                                اطالعاتورودتوسطکاربر،مسئولیتیمتوجهمجموعهنخواهدبود.
                                </li>
                                </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                موارد نقض قوانین و پیامدهای آن:
                            </h3>
                            <p>
                                در صورت نقض هر یک از قوانین بالا، مجموعه میتواند حساب کاربری را محدود، تعلیق یا مسدود کند.
                                درصورتمشاهدهتخلفاتجدی(مانندپولشویی،کالهبردارییااستفادهازکارتهایسرقتی)،اطالعاتحسابکاربری
                                بهمراجعقانونیارجاعدادهخواهدشد.
                                درخواستبازگشتوجهدرصورتنقضقوانین،تنهادرشرایطخاصوپسازبررسیتیممالیانجامخواهدشد.
                            </p>
                        </li>
                    </ol>
                </li>

                <li>
                    <h2>
                        ثبتنام و احراز هویت:
                    </h2>
                    <p>
                        این بخش به شرایط و مراحل ثبتنام، احراز هویت و نحوه استفاده از حساب کاربری میپردازد. هدف از احراز هویت،
                        افزایش امنیت تراکنشها و جلوگیری از فعالیتهای غیرقانونی است.
                    </p>

                    <ol className="custom-counter">
                        <li>
                            <h3>
                                شرایط ثبتنام در وبسایت:
                            </h3>
                            <p>

                                <ul>
                                    <li>
                                    کاربران برای استفاده از خدمات باید بااطالعات صحیح و معتبردر وبسایت ثبتنام کنند.
                                </li>
                                <li>
                                    هنگام ثبتنام، اطالعاتی از جمله نام و نام خانوادگی، شماره موبایل، ایمیل و رمز عبور درخواست میشود.
                                </li>
                                <li>
                                    کاربران موظفاندرمز عبور قوی انتخاب کرده و از اشتراکگذاری آن با دیگران خودداری کنند.
                                </li>
                                <li>
                                    در صورت واردکردن اطالعات نادرست، حساب کاربری ممکن است غیرفعال یا مسدود شود.
                                </li>
                                </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                ضرورت احراز هویت و مدارک موردنیاز:
                            </h3>
                            <p>

                                <ul>
                                    <li>
                                    برای استفاده از برخی خدمات (مانند نقد کردن درآمد دالری و پرداختهای بین المللی)، کاربران باید احراز هویت شوند.
                                </li>
                                <li>
                                    احراز هویت شامل ارسال مدارک شناسایی معتبر (مانند کارت ملی یا گذرنامه) و تأیید شماره تماس و ایمیل است.
                                </li>
                                <li>
                                    در برخی موارد، برای اطمینان از مالکیت حساب،یک عکس سلفی به همراه کارت شناسایی و یک دستنوشته
                                تأیید هویتدرخواست میشود.
                                </li>
                                <li>
                                    اطالعات ارائهشده باید کامال ً واضح، خوانا و متعلق به شخص ثبتنامکننده باشد.
                                </li>
                                </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                تأیید و بررسی مدارک:
                            </h3>
                            <p>

                                <ul>
                                    <li>
                                    تمامی مدارک ارسالی توسط تیم پشتیبانی بررسی میشود و در صورت تطابق با شرایط، حساب کاربر تأیید خواهد شد.
                                </li>
                                <li>
                                    فرایند بررسی مدارک معموال ً بین۲۴تا۷۲ساعتزمان میبرد.
                                </li>
                                <li>
                                    در صورت وجود نقص در مدارک، از طریق ایمیل یا پیامک به کاربر اطالع داده میشود.
                                </li>
                                <li>
                                    این وبسایت حق دارد که در صورت عدم تأیید هویت کاربر، ارائه خدمات را متوقف کند.
                                </li>
                                </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                امنیت و محرمانگی اطالعات کاربران:
                            </h3>
                            <p>

                                <ul>
                                    <li>
                                    تمامی اطالعات ثبتشده و مدارک ارسالشده توسط کاربرانبهصورت محرمانه نگهداری میشود.
                                </li>
                                <li>
                                    این وبسایت متعهد است که اطالعات کاربران را در اختیار شخص ثالث قرار ندهد، مگر در مواردی کهمطابق با
                                قوانین و درخواست مراجع قضایی باشد.
                                </li>
                                <li>
                                    کاربران موظف ًاند از اطالعات ورود خود محافظت کرده و در صورت مشاهده هرگونه فعالیت مشکوک، فورا
                                پشتیبانی را مطلع کنند.
                                </li>
                                </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                شرایط تغییر اطالعات حساب کاربری:
                            </h3>
                            <p>

                                <ul>
                                    <li>
                                    کاربران میتوانند برخی از اطالعات حساب خود مانندشماره تماس و ایمیل را از طریق پنل کاربری تغییر دهند.
                                </li>
                                <li>
                                    تغییر اطالعات حساس (مانند نام، مشخصات شناسایی و حساب بانکی)تنها از طریق درخواست پشتیبانی و ارائه
                                مدارک جدید ممکن است.
                                </li>
                                <li>
                                    هرگونه سوءاستفاده یا تالش برای تغییر غیرقانونی اطالعات، منجر بهمسدود شدن حساب کاربریخواهد شد.
                                </li>
                                </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                حذف حساب کاربری:
                            </h3>
                            <p>

                                <ul>
                                    <li>
                                    کاربران میتوانند درخواست حذف حساب کاربری خود را از طریق پشتیبانی ارسال کنند.
                                </li>
                                <li>
                                    در صورت وجودتراکنشهای مالی در جریان، ابتدا باید وضعیت تمامی پرداختها مشخص و تسویه شود.
                                </li>
                                <li>
                                    پس از حذف حساب، امکان بازگردانی اطالعات وجود ندارد و کاربران باید در تصمیم خود دقت کنند.
                                </li>
                                </ul>
                            </p>
                        </li>
                    </ol>
                </li>

                <li>
                    <h2>
                        قوانین و شرایط تراکنشهای مالی:
                    </h2>
                    <p>
                        این بخش شامل قوانین و مقررات مربوط به انجام تراکنشهای مالی از جمله پرداختها، تسویهحسابها، هزینههای
                        خدمات و محدودیتهای مالی است. رعایت این موارد برای اطمینان از انجام صحیح و قانونی تراکنشها ضروری است.
                    </p>
                    <ol className="custom-counter">
                        <li>
                            <h3>
                                روشهای پرداخت و شارژ حساب:
                            </h3>
                            <p>

                                <ul>
                                    <li>
                                    کاربران میتوانند از روشهایپرداخت آنالین از طریق درگاه بانکی معتبربرای شارژ حساب کاربری خود استفاده
                                کنند.
                                </li>
                                <li>
                                    در برخی موارد، امکانواریز مستقیم به حساب مجموعهنیز وجود دارد که اطالعات موردنیاز از طریق پشتیبانی
                                ارائه خواهد شد.
                                </li>
                                <li>
                                    تمامی پرداختها باید از حسابهایمتعلق به خود کاربرانجام شود. پرداختهایی که از حساب اشخاص ثالث
                                انجام شده باشند، ممکن است تأیید نشوند.
                                </li>
                                </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                قوانین مربوط به نقد کردن درآمد دالری:
                            </h3>
                            <p>

                                <ul>
                                    <li>
                                    کاربران میتوانند درآمدهای ارزی خود را از طریق این وبسایت نقد کنند، اما موظفاندمنبع درآمد خود را بهصورت
                                شفاف اعالم کنند.
                                </li>
                                <li>
                                    درآمدهای حاصل ازفعالیتهای غیرقانونی، قمار، شرطبندی و موارد مشابه قابلپردازش نیستند.
                                </li>
                                <li>
                                    نرخ تبدیل ارز بر اساسقیمت روز بازار و نرخمجموعهتعیین شده و ممکن است در طول روز تغییر کند.
                                </li>
                                <li>
                                    تسویه ًحساب درآمد دالری کاربران معموالبین۲۴تا۷۲ساعت کاریانجام میشود، مگر در مواردی که نیاز به
                                بررسی بیشتر داشته باشد.
                                </li>
                                </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                کارمزدها و هزینههای خدمات:</h3>
                            <p>

                                <ul>
                                    <li>
                                    برای هر تراکنش مالی، بسته به نوع آنکارمزد مشخصی اعمال میشودکه در هنگام انجام درخواست به کاربر
                                اطالع داده خواهد شد.
                                </li>
                                <li>
                                    کارمزدهای مربوط به نقد کردن درآمد دالری، خرید گیفت کارت و پرداختهای بین المللی متفاوت بوده و ممکن است
                                بر اساس تغییرات بازار بهروزرسانی شوند.
                                </li>
                                <li>
                                    کاربران موظفاندقبل از انجام تراکنش، هزینهها را بررسی کرده و با آن موافقت کنند.
                                </li>
                                </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                دودیتها و سقف تراکنشها:</h3>
                            <p>

                                <ul>
                                    <li>
                                    برای جلوگیری از سوءاستفاده و مطابقت با قوانین مالی، ممکن است سقفهایی برای تراکنشهای مالی کاربران در
                                نظر گرفته شود.
                                </li>
                                <li>
                                    سقف تراکنشهای روزانه و ماهانهبر اساس سطح احراز هویت کاربران متغیر است.
                                </li>
                                <li>
                                    کاربران در صورت نیاز به افزایش سقف تراکنش، بایددرخواست ارتقای سطح کاربری و ارسال مدارک تکمیلی را
                                ارائه دهند.
                                </li>
                                </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                شرایط بازگشت وجه و لغو تراکنش:</h3>
                            <p>

                                <ul>
                                    <li>
                                    به دلیل ماهیت خدمات ارائهشده،امکان لغو تراکنشهای انجامشده و درخواست بازگشت وجه وجود ندارد،
                                مگر در مواردی که خطای سیستمی رخ داده باشد.
                                </li>
                                <li>
                                    در صورت بروز مشکل در انجام پرداخت بین المللی یا خرید گیفت کارت، کاربر بایددر اسرع وقت با پشتیبانی تماس
                                بگیرد تا موضوع بررسی شود.
                                </li>
                                <li>
                                    در صورتی که وجهی به اشتباه به حساب مجموعه واریز شود، کاربر بایدمدارک مربوطه را ارائه کندتا در صورت
                                تأیید، مبلغ به حساب وی بازگردانده شود.
                                </li>
                                </ul>
                            </p>
                        </li>
                        <li>
                            <h3>
                                مسئولیتهای کاربر در تراکنشهای مالی:</h3>
                            <p>

                                <ul>
                                    <li>
                                    کاربران موظفاند قبل از تأیید تراکنش،اطالعات واردشده را با دقت بررسی کنند.در صورت واردکردن اطالعات
                                اشتباه، مسئولیت هرگونه ضرر و زیان بر عهده کاربر خواهد بود.
                                </li>
                                <li>
                                    این مجموعه هیچگونه مسئولیتی در قبالپرداختهای ناموفق به دلیل مشکالت بانکی، اینترنتی یا
                                تحریمهای بین المللی ندارد.
                                </li>
                                <li>
                                    کاربران باید از کیف پولهای دیجیتالی و حسابهای بانکی امن برای انجام تراکنشها استفاده کنند و از
                                اشتراکگذاری اطالعات بانکی خود با دیگران خودداری نمایند.
                                </li>
                                </ul>
                            </p>
                        </li>
                    </ol>
                </li>
            </ol>
            </div>
    );
        
}