import Section from "@/components/layout/main/Section";

export default function SocialMedia() {

    const items = [
        {
            svg: (
                <svg width="69" height="85" viewBox="0 0 69 85" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path opacity="0.12" d="M26 0H47.5C59.3741 0 69 9.62588 69 21.5V63.5C69 75.3741 59.3741 85 47.5 85H26V0Z" fill="#0000A1" />
                    <g filter="url(#filter0_i_0_1)">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M12.3335 21.3333C7.91522 21.3333 4.3335 24.915 4.3335 29.3333V56.6667C4.3335 61.0849 7.91521 64.6666 12.3335 64.6666H39.6668C44.0851 64.6666 47.6668 61.0849 47.6668 56.6667V29.3333C47.6668 24.915 44.0851 21.3333 39.6668 21.3333H12.3335ZM39.0002 32.1666C40.1968 32.1666 41.1668 31.1966 41.1668 30C41.1668 28.8034 40.1968 27.8333 39.0002 27.8333C37.8035 27.8333 36.8335 28.8034 36.8335 30C36.8335 31.1966 37.8035 32.1666 39.0002 32.1666ZM36.8335 43C36.8335 48.9831 31.9832 53.8333 26.0002 53.8333C20.0171 53.8333 15.1668 48.9831 15.1668 43C15.1668 37.0169 20.0171 32.1666 26.0002 32.1666C31.9832 32.1666 36.8335 37.0169 36.8335 43ZM26.0002 49.5C29.59 49.5 32.5002 46.5898 32.5002 43C32.5002 39.4101 29.59 36.5 26.0002 36.5C22.4103 36.5 19.5002 39.4101 19.5002 43C19.5002 46.5898 22.4103 49.5 26.0002 49.5Z" fill="#0000A1" />
                    </g>
                    <defs>
                        <filter id="filter0_i_0_1" x="4.3335" y="20.3333" width="44.3335" height="44.3333" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                            <feFlood flood-opacity="0" result="BackgroundImageFix" />
                            <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape" />
                            <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                            <feOffset dx="1" dy="-1" />
                            <feGaussianBlur stdDeviation="3.5" />
                            <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1" />
                            <feColorMatrix type="matrix" values="0 0 0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 1 0" />
                            <feBlend mode="normal" in2="shape" result="effect1_innerShadow_0_1" />
                        </filter>
                    </defs>
                </svg>
            ),
            title: 'اینستاگرام ما',
            address: '@avalcartcom'
        },
        {
            svg: (
                <svg width="70" height="85" viewBox="0 0 70 85" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path opacity="0.12" d="M26.5 0H48C59.8741 0 69.5 9.62588 69.5 21.5V63.5C69.5 75.3741 59.8741 85 48 85H26.5V0Z" fill="#0000A1" />
                    <g filter="url(#filter0_i_0_1)">
                        <path d="M8.71001 40.8752C21.1359 35.3131 36.4172 28.9392 38.6523 28.0371C44.0086 25.8714 45.9795 27.1564 45.4035 31.3415C44.8685 35.2161 42.9698 47.2047 41.639 55.2414C40.8545 59.9721 38.5637 61.0139 35.5803 59.0815C33.7111 57.8755 26.1886 52.9131 24.3638 51.4687C22.9525 50.353 21.4904 49.0648 23.1987 47.1998C23.7698 46.577 26.9238 43.5289 29.282 41.2614C30.649 39.9452 30.1616 39.2961 28.5123 40.4266C25.4879 42.5019 20.5402 45.7866 19.6573 46.3831C17.9753 47.5169 16.395 47.7897 13.6446 46.9237C11.4768 46.2402 9.38284 45.578 8.29155 45.1524C5.85298 44.2059 5.82016 42.1684 8.71001 40.8752Z" fill="#0000A1" />
                    </g>
                    <defs>
                        <filter id="filter0_i_0_1" x="6.5" y="26" width="40" height="34" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                            <feFlood flood-opacity="0" result="BackgroundImageFix" />
                            <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape" />
                            <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                            <feOffset dx="1" dy="-1" />
                            <feGaussianBlur stdDeviation="3.5" />
                            <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1" />
                            <feColorMatrix type="matrix" values="0 0 0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 1 0" />
                            <feBlend mode="normal" in2="shape" result="effect1_innerShadow_0_1" />
                        </filter>
                    </defs>
                </svg>

            ),
            title: 'تلگرام ما',
            address: '@avalcartcom'
        },
        {
            svg: (
                <svg width="69" height="85" viewBox="0 0 69 85" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path opacity="0.12" d="M26 0H47.5C59.3741 0 69 9.62588 69 21.5V63.5C69 75.3741 59.3741 85 47.5 85H26V0Z" fill="#0000A1" />
                    <g filter="url(#filter0_i_0_1)">
                        <path d="M23.2627 23.2371L19.3654 22.221C18.533 21.9992 17.665 21.9437 16.8111 22.0575C15.9573 22.1714 15.1342 22.4524 14.389 22.8846C13.6438 23.3168 12.9911 23.8915 12.4682 24.5761C11.9452 25.2607 11.5624 26.0416 11.3414 26.8742L10.3687 30.5485C13.5766 26.5558 18.1894 23.9402 23.2627 23.2371Z" fill="#0000A1" />
                        <path d="M6.1678 46.3672L5.2136 49.9671C4.76756 51.6474 5.00721 53.436 5.87985 54.9396C6.75249 56.4432 8.18665 57.5386 9.86687 57.9849L13.5845 58.9762C9.6149 55.8552 6.96679 51.3532 6.1678 46.3672Z" fill="#0000A1" />
                        <path d="M42.4522 28.3489L38.2822 27.2398C40.3893 28.8606 42.1535 30.8838 43.4724 33.1919C44.7914 35.5 45.6387 38.0471 45.9654 40.6853L47.1117 36.3481C47.5519 34.6695 47.3086 32.8849 46.4352 31.3855C45.5618 29.886 44.1294 28.794 42.4522 28.3489Z" fill="#0000A1" />
                        <path d="M28.9634 63.0532L32.9599 64.1313C34.6401 64.5774 36.4288 64.3377 37.9324 63.4651C39.436 62.5924 40.5314 61.1583 40.9776 59.4781L42.1053 55.2399C38.9258 59.4748 34.2027 62.2829 28.9634 63.0532Z" fill="#0000A1" />
                        <path d="M26.1626 24.8109C22.5313 24.8097 18.9811 25.8854 15.9612 27.902C12.9412 29.9185 10.5872 32.7854 9.19665 36.14C7.80615 39.4945 7.44169 43.1861 8.14938 46.7478C8.85707 50.3095 10.6051 53.5814 13.1724 56.1496C15.7397 58.7177 19.011 60.4669 22.5725 61.1758C26.1339 61.8847 29.8256 61.5214 33.1807 60.1321C36.5357 58.7427 39.4034 56.3896 41.421 53.3703C43.4385 50.3511 44.5154 46.8013 44.5154 43.1699C44.5154 38.3019 42.582 33.6332 39.1404 30.1903C35.6987 26.7475 31.0306 24.8126 26.1626 24.8109ZM15.7656 33.9687C15.9619 32.9509 16.4555 32.0141 17.1842 31.2768C17.9128 30.5395 18.8438 30.0348 19.8592 29.8264C20.8747 29.6181 21.9291 29.7156 22.8892 30.1065C23.8493 30.4973 24.6719 31.1641 25.2531 32.0225C25.8343 32.8808 26.148 33.8922 26.1544 34.9288C26.1608 35.9654 25.8598 36.9806 25.2893 37.8462C24.7188 38.7117 23.9046 39.3886 22.9494 39.7914C21.9942 40.1942 20.9411 40.3047 19.9231 40.1091C19.2469 39.9791 18.6028 39.7171 18.0278 39.3381C17.4529 38.9592 16.9582 38.4706 16.5721 37.9004C16.186 37.3301 15.916 36.6894 15.7776 36.0148C15.6392 35.3402 15.6351 34.6449 15.7656 33.9687ZM23.3929 49.8308C23.1953 50.8482 22.7003 51.7843 21.9708 52.5205C21.2412 53.2568 20.3098 53.7603 19.2941 53.9673C18.2785 54.1743 17.2243 54.0755 16.2648 53.6835C15.3053 53.2915 14.4835 52.6238 13.9034 51.7649C13.3232 50.9059 13.0107 49.8943 13.0054 48.8578C13.0002 47.8213 13.3023 46.8065 13.8736 45.9416C14.4449 45.0768 15.2598 44.4007 16.2153 43.9989C17.1707 43.5971 18.2239 43.4876 19.2416 43.6842C19.9179 43.8149 20.5619 44.0776 21.1366 44.4573C21.7114 44.837 22.2057 45.3262 22.5912 45.8971C22.9768 46.4679 23.246 47.1091 23.3836 47.7841C23.5211 48.4591 23.5243 49.1545 23.3929 49.8308ZM25.6173 45.5864C25.1656 45.499 24.7498 45.2798 24.4224 44.9564C24.0951 44.6329 23.8708 44.2198 23.778 43.7691C23.6852 43.3184 23.7279 42.8503 23.9008 42.4238C24.0737 41.9974 24.369 41.6317 24.7494 41.3728C25.1299 41.114 25.5785 40.9736 26.0387 40.9695C26.4988 40.9653 26.9499 41.0975 27.335 41.3494C27.7202 41.6012 28.0221 41.9615 28.2027 42.3848C28.3832 42.808 28.4345 43.2753 28.3498 43.7276C28.2933 44.0295 28.1777 44.3173 28.0096 44.5743C27.8415 44.8314 27.6242 45.0526 27.3702 45.2254C27.1163 45.3981 26.8307 45.519 26.5298 45.5809C26.229 45.6429 25.9189 45.6448 25.6173 45.5864ZM36.5535 52.3588C36.3571 53.3766 35.8635 54.3134 35.1348 55.0507C34.4062 55.788 33.4753 56.2927 32.4598 56.5011C31.4443 56.7094 30.3899 56.6119 29.4298 56.221C28.4697 55.8302 27.6471 55.1634 27.0659 54.305C26.4847 53.4467 26.1711 52.4353 26.1646 51.3987C26.1582 50.3621 26.4592 49.3469 27.0297 48.4813C27.6002 47.6158 28.4144 46.9389 29.3696 46.5361C30.3248 46.1333 31.3779 46.0228 32.3959 46.2184C33.0721 46.3484 33.7162 46.6104 34.2912 46.9894C34.8661 47.3684 35.3608 47.8569 35.7469 48.4272C36.133 48.9974 36.403 49.6381 36.5414 50.3127C36.6798 50.9873 36.6839 51.6826 36.5535 52.3588ZM33.0836 42.6433C32.0658 42.447 31.129 41.9533 30.3917 41.2246C29.6544 40.496 29.1497 39.5651 28.9413 38.5496C28.733 37.5342 28.8305 36.4797 29.2214 35.5196C29.6122 34.5595 30.279 33.7369 31.1374 33.1557C31.9957 32.5745 33.0071 32.2609 34.0437 32.2544C35.0803 32.248 36.0955 32.549 36.9611 33.1195C37.8266 33.69 38.5035 34.5043 38.9063 35.4594C39.3091 36.4146 39.4196 37.4677 39.224 38.4857C39.0947 39.1625 38.8332 39.8072 38.4546 40.3829C38.0759 40.9586 37.5874 41.454 37.0171 41.8407C36.4468 42.2274 35.8058 42.4979 35.1309 42.6367C34.4559 42.7755 33.7603 42.7798 33.0836 42.6495V42.6433Z" fill="#0000A1" />
                    </g>
                    <defs>
                        <filter id="filter0_i_0_1" x="4.99414" y="21" width="43.332" height="43.3508" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                            <feFlood flood-opacity="0" result="BackgroundImageFix" />
                            <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape" />
                            <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                            <feOffset dx="1" dy="-1" />
                            <feGaussianBlur stdDeviation="2" />
                            <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1" />
                            <feColorMatrix type="matrix" values="0 0 0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 1 0" />
                            <feBlend mode="normal" in2="shape" result="effect1_innerShadow_0_1" />
                        </filter>
                    </defs>
                </svg>


            ),
            title: 'آپارات ما',
            address: '@avalcartcom'
        },
        {
            svg: (
                <svg width="69" height="85" viewBox="0 0 69 85" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path opacity="0.12" d="M26 0H47.5C59.3741 0 69 9.62588 69 21.5V63.5C69 75.3741 59.3741 85 47.5 85H26V0Z" fill="#0000A1" />
                    <g filter="url(#filter0_i_0_1)">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M9.47021 23.5C5.60422 23.5 2.47021 26.634 2.47021 30.5V55.5C2.47021 59.366 5.60422 62.5 9.47021 62.5H42.5299C46.3959 62.5 49.5299 59.366 49.5299 55.5V30.5C49.5299 26.634 46.3959 23.5 42.5299 23.5H9.47021ZM35.0446 42.1056L20.9473 35.0569C20.2824 34.7245 19.5001 35.208 19.5001 35.9514V50.0486C19.5001 50.792 20.2824 51.2755 20.9473 50.9431L35.0446 43.8944C35.7817 43.5259 35.7817 42.4741 35.0446 42.1056Z" fill="#0000A1" />
                    </g>
                    <defs>
                        <filter id="filter0_i_0_1" x="2.47021" y="22.5" width="48.0596" height="40" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                            <feFlood flood-opacity="0" result="BackgroundImageFix" />
                            <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape" />
                            <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                            <feOffset dx="1" dy="-1" />
                            <feGaussianBlur stdDeviation="3.5" />
                            <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1" />
                            <feColorMatrix type="matrix" values="0 0 0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 1 0" />
                            <feBlend mode="normal" in2="shape" result="effect1_innerShadow_0_1" />
                        </filter>
                    </defs>
                </svg>
            ),
            title: 'یوتیوب ما',
            address: '@avalcartcom'
        },
        {
            svg: (
                <svg width="70" height="85" viewBox="0 0 70 85" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path opacity="0.12" d="M26.5 0H48C59.8741 0 69.5 9.62588 69.5 21.5V63.5C69.5 75.3741 59.8741 85 48 85H26.5V0Z" fill="#0000A1" />
                    <g filter="url(#filter0_i_0_1)">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M15.2333 25.45C15.2333 27.7236 13.3902 29.5666 11.1167 29.5666C8.84309 29.5666 7 27.7236 7 25.45C7 23.1764 8.84309 21.3333 11.1167 21.3333C13.3902 21.3333 15.2333 23.1764 15.2333 25.45ZM15.2333 34.7121V62.4996H7V34.7121H15.2333ZM21.4084 34.7121H29.6417V36.444C30.9293 35.9889 32.3149 35.7412 33.7584 35.7412C40.5791 35.7412 46.1084 41.2705 46.1084 48.0912V62.4996H37.8751V48.0912C37.8751 45.8176 36.032 43.9746 33.7584 43.9746C31.4848 43.9746 29.6417 45.8176 29.6417 48.0912V62.4996H21.4084V48.0912V34.7121Z" fill="#0000A1" />
                    </g>
                    <defs>
                        <filter id="filter0_i_0_1" x="7" y="20.3333" width="40.1084" height="42.1663" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                            <feFlood flood-opacity="0" result="BackgroundImageFix" />
                            <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape" />
                            <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                            <feOffset dx="1" dy="-1" />
                            <feGaussianBlur stdDeviation="3.5" />
                            <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1" />
                            <feColorMatrix type="matrix" values="0 0 0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 1 0" />
                            <feBlend mode="normal" in2="shape" result="effect1_innerShadow_0_1" />
                        </filter>
                    </defs>
                </svg>),
            title: 'لینکدین ما',
            address: '@avalcartcom'
        },
    ]

    return (
        <div className="grid grid-cols-3 gap-4 mt-6">
            {
                items.map(item =>
                    <Section className={'flex text-gray-900 items-center '} p="p-4">

                        <div>
                            {item.svg}
                        </div>

                        <div className="space-y-1">

                            <div className="text-xl font-extrabold">
                                {item.title}
                            </div>

                            <div className="text-xxs">
                                {item.address}
                            </div>

                        </div>

                    </Section>
                )
            }
        </div>
    );
}