import TitleWithBlue from "@/components/layout/TitleWithBlue";
import Question from "@/components/layout/main/askedQuestions/Question";

export default function Faq({questions}) {
    return (
        <div id="faq" className="bg-blue-light p-10 mt-20">
            <div className="container grid md:grid-cols-12 grid-cols-1 gap-8">
                <div className="md:col-span-7">
                    <TitleWithBlue blue={'سوالات متداول'} className={'!mt-0'}>
                        را بخوانید
                    </TitleWithBlue>
                    <div className="text-[#191919] opacity-50 mt-5">
                        سولات متداول را بخوانید تا از تمام جزئیات مطلع شوید
                    </div>

                    <div className="space-y-4 mt-7">
                        {questions && Object.entries(questions).length > 0 ?

                            <>
                                {Object.entries(questions).map(([key, question], index) => (
                                    <Question
                                        className="bg-white"
                                        ques={question.title}
                                        answer={question.description}
                                        number={index + 1}
                                        key={key}
                                    />
                                ))}
                            </>

                            :
                            <>
                                <Question className="bg-white" ques={'چگونه درآمدمان را نقد کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'1'} />
                                <Question className="bg-white" ques={'چگونه سفارش را کنسل کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'2'} />
                                <Question ques={'چگونه گیفت کارت را فعال کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'3'} />
                                <Question ques={'چگونه خرید خود را از آمازون پیگیری کنیم؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'4'} />
                                <Question ques={'چگونه حساب های بین المللی به نام ما میشود؟'} answer={'.دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید. دسترسی به میلیونها محصول در سرار دنیا و خریدی لذت بخش برای خرید محصولات اورجینال تا اخرید از امازون یه کلیک فاصله دارید'} number={'5'} />

                            </>

                        }

                        </div>
                </div>
                <div className="md:col-span-5 mt-4 md:mt-10">
                    <img loading="lazy" src="/images/photo_2025-05-12_13-59-10.jpg" className="rounded-lg w-full object-cover" />
                </div>
            </div>
        </div>
    );
}