"use client"

import { useEffect, useState } from "react";

const defaultItems = [
    {
        title: "گیفت کارت ها",
        icon: <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M2.79477 18.4216H23.6281M8.0031 11.1299L11.1281 8.00494M15.2948 8.00494L18.4198 11.1299M4.8781 22.5883H21.5448C22.6954 22.5883 23.6281 21.6555 23.6281 20.5049V10.0883C23.6281 8.93768 22.6954 8.00494 21.5448 8.00494H4.8781C3.72751 8.00494 2.79477 8.93768 2.79477 10.0883V20.5049C2.79477 21.6555 3.72751 22.5883 4.8781 22.5883ZM12.1698 5.92161C12.1698 7.0722 11.237 8.00494 10.0864 8.00494C8.93584 8.00494 8.0031 7.0722 8.0031 5.92161C8.0031 4.77101 8.93584 3.83827 10.0864 3.83827C11.237 3.83827 12.1698 4.77101 12.1698 5.92161ZM18.4198 5.92161C18.4198 7.0722 17.487 8.00494 16.3364 8.00494C15.1858 8.00494 14.2531 7.0722 14.2531 5.92161C14.2531 4.77101 15.1858 3.83827 16.3364 3.83827C17.487 3.83827 18.4198 4.77101 18.4198 5.92161Z" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
        </svg>

    },
    {
        title: "گیفت کارت ها",
        icon: <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M2.79477 18.4216H23.6281M8.0031 11.1299L11.1281 8.00494M15.2948 8.00494L18.4198 11.1299M4.8781 22.5883H21.5448C22.6954 22.5883 23.6281 21.6555 23.6281 20.5049V10.0883C23.6281 8.93768 22.6954 8.00494 21.5448 8.00494H4.8781C3.72751 8.00494 2.79477 8.93768 2.79477 10.0883V20.5049C2.79477 21.6555 3.72751 22.5883 4.8781 22.5883ZM12.1698 5.92161C12.1698 7.0722 11.237 8.00494 10.0864 8.00494C8.93584 8.00494 8.0031 7.0722 8.0031 5.92161C8.0031 4.77101 8.93584 3.83827 10.0864 3.83827C11.237 3.83827 12.1698 4.77101 12.1698 5.92161ZM18.4198 5.92161C18.4198 7.0722 17.487 8.00494 16.3364 8.00494C15.1858 8.00494 14.2531 7.0722 14.2531 5.92161C14.2531 4.77101 15.1858 3.83827 16.3364 3.83827C17.487 3.83827 18.4198 4.77101 18.4198 5.92161Z" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
        </svg>

    },
    {
        title: "گیفت کارت ها",
        icon: <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M2.79477 18.4216H23.6281M8.0031 11.1299L11.1281 8.00494M15.2948 8.00494L18.4198 11.1299M4.8781 22.5883H21.5448C22.6954 22.5883 23.6281 21.6555 23.6281 20.5049V10.0883C23.6281 8.93768 22.6954 8.00494 21.5448 8.00494H4.8781C3.72751 8.00494 2.79477 8.93768 2.79477 10.0883V20.5049C2.79477 21.6555 3.72751 22.5883 4.8781 22.5883ZM12.1698 5.92161C12.1698 7.0722 11.237 8.00494 10.0864 8.00494C8.93584 8.00494 8.0031 7.0722 8.0031 5.92161C8.0031 4.77101 8.93584 3.83827 10.0864 3.83827C11.237 3.83827 12.1698 4.77101 12.1698 5.92161ZM18.4198 5.92161C18.4198 7.0722 17.487 8.00494 16.3364 8.00494C15.1858 8.00494 14.2531 7.0722 14.2531 5.92161C14.2531 4.77101 15.1858 3.83827 16.3364 3.83827C17.487 3.83827 18.4198 4.77101 18.4198 5.92161Z" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
        </svg>

    },
    {
        title: "گیفت کارت ها",
        icon: <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M2.79477 18.4216H23.6281M8.0031 11.1299L11.1281 8.00494M15.2948 8.00494L18.4198 11.1299M4.8781 22.5883H21.5448C22.6954 22.5883 23.6281 21.6555 23.6281 20.5049V10.0883C23.6281 8.93768 22.6954 8.00494 21.5448 8.00494H4.8781C3.72751 8.00494 2.79477 8.93768 2.79477 10.0883V20.5049C2.79477 21.6555 3.72751 22.5883 4.8781 22.5883ZM12.1698 5.92161C12.1698 7.0722 11.237 8.00494 10.0864 8.00494C8.93584 8.00494 8.0031 7.0722 8.0031 5.92161C8.0031 4.77101 8.93584 3.83827 10.0864 3.83827C11.237 3.83827 12.1698 4.77101 12.1698 5.92161ZM18.4198 5.92161C18.4198 7.0722 17.487 8.00494 16.3364 8.00494C15.1858 8.00494 14.2531 7.0722 14.2531 5.92161C14.2531 4.77101 15.1858 3.83827 16.3364 3.83827C17.487 3.83827 18.4198 4.77101 18.4198 5.92161Z" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
        </svg>

    },
]


export default function InlineMenu({ items = defaultItems, itemClasses='', className='', color='text-muted-2', setActiveItem, activeDefault=0 }) {

    const [active, setActive] = useState(activeDefault);
    const [lists, setLists] = useState(items);

    useEffect(() => {
        if (setActiveItem) {
            setActiveItem(active)
        }
    }, [active])

    useEffect(() => {
            setActive(activeDefault)
    }, [activeDefault])


    return (
        <div className={`custom-shadow rounded-[10px] flex  p-5 mt-custom-4 flex-nowrap overflow-x-auto ${className}`}>
            {
                lists.map((item, index) =>
                    <div className={`flex flex-nowrap items-center align-middle gap-[10px] cursor-pointer min-w-max ${itemClasses} rounded-[20px] h-[2.75rem] px-5 transition-all ${index === active ? 'bg-greenLight text-white' : color} `}

                        onClick={() => setActive(index)}
                    >
                        <div>
                            {item.icon}
                        </div>
                        <div className="mt-[2px] flex-nowrap flex">
                            {item.title}
                        </div>
                    </div>
                )
            }
        </div>
    );
}