import Order from "./order";
import Button from "../../../components/ui/globals/Button";



export default function CurrencyIncome({home=false}) {
    return (
        <div className="grid md:grid-cols-12 grid-cols-1 gap-12">

            <div className="md:col-span-7  mt-5">
                {home && <h2 className="text-3xl leading-10 text-[#191919] font-bold">نقد کردن درآمد دلاری در سریع ترین حالت </h2>
                }
                {!home && <h1 className="text-3xl leading-10 text-[#191919] font-bold">نقد کردن درآمد دلاری در سریع ترین حالت </h1>
                }

                <p className="text-blue-custom mt-7 text-lg font-semibold">نقد کردن درامد دلاری و ارزی خودت رو با کمترین کارمزد به ما بسپار</p>
                <p className="leading-8 mt-7 text-sm">
                    اگر از سایت‌های خارجی درآمد ارزی کسب می‌کنید، حتماً با چالش نقد کردن آن روبه‌رو بوده‌اید. ما در اول‌کارت با تجربه‌ی بالا در نقد کردن درآمد دلاری، راه‌حلی سریع، قانونی و قابل اعتماد به شما ارائه می‌دهیم. فقط کافیست اطلاعات تراکنش یا حساب مقصد را به ما بدهید تا باقی مسیر را با اطمینان برایتان انجام دهیم.
                </p>

                <Order />

                <div className="flex gap-6 mt-10">
                    <Button href={"/panel/currency-income"} flex size="auto">
                        همین الان نقدش کن
                    </Button>
                    {!home && <Button flex href='#faq' outline={'blue'} size="auto">
                        <div>
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M7 2.68018C5.60011 2.68018 4.40241 3.13519 3.55371 3.98389C2.70509 4.83257 2.25 6.03035 2.25 7.43018V13.4302C2.25004 14.83 2.70505 16.0278 3.55371 16.8765C4.4024 17.7251 5.60016 18.1802 7 18.1802C7.13386 18.1802 7.25 18.2963 7.25 18.4302V20.5601C7.25003 20.9526 7.51615 21.1444 7.62305 21.2085C7.76644 21.2945 8.02108 21.3695 8.29199 21.2534L8.4082 21.1919L8.41699 21.186L12.8672 18.2261C12.912 18.1962 12.9666 18.1802 13.0098 18.1802H17.0098C18.4095 18.1802 19.6074 17.725 20.4561 16.8765C21.3047 16.0278 21.7597 14.83 21.7598 13.4302V7.43018C21.7598 6.03028 21.3047 4.83258 20.4561 3.98389C19.6074 3.13519 18.4097 2.68018 17.0098 2.68018H7ZM6.75 18.6987L6.30078 18.6528C4.90384 18.5094 3.77458 17.9283 2.99316 17.0405C2.21101 16.1519 1.75001 14.9243 1.75 13.4399V7.43994C1.75 5.83448 2.28679 4.5301 3.18848 3.62842C4.09016 2.72673 5.39454 2.18994 7 2.18994H17C18.6055 2.18994 19.9098 2.72673 20.8115 3.62842C21.7132 4.5301 22.25 5.83448 22.25 7.43994V13.4399C22.25 15.0454 21.7132 16.3498 20.8115 17.2515C19.9098 18.1531 18.6054 18.6899 17 18.6899H13.0781L8.69238 21.6138C8.485 21.7487 8.24184 21.8198 8 21.8198C7.85093 21.8198 7.6962 21.7922 7.5498 21.7358L7.40723 21.6694L7.40332 21.6675L7.25977 21.5786C6.94318 21.3495 6.75 20.9726 6.75 20.5698V18.6987Z" fill="currentColor" stroke="currentColor" />
                                <path d="M12 6.60999C13.0538 6.61008 13.9102 7.46633 13.9102 8.52014C13.9101 9.37615 13.2924 9.81395 12.9824 10.024C12.7752 10.1622 12.5853 10.3107 12.4521 10.4967C12.3023 10.706 12.25 10.9249 12.25 11.15V11.36C12.25 11.4994 12.1381 11.6099 12 11.61C11.8661 11.61 11.75 11.4938 11.75 11.36V11.15C11.75 10.2718 12.3791 9.83468 12.7031 9.61194L12.7021 9.61096C12.8998 9.47718 13.0817 9.33362 13.21 9.15491C13.3541 8.95386 13.4101 8.7416 13.4102 8.52014C13.4102 7.7441 12.7761 7.11009 12 7.10999C11.2238 7.10999 10.5898 7.74404 10.5898 8.52014C10.5898 8.65395 10.4737 8.77014 10.3398 8.77014C10.206 8.77014 10.0899 8.65395 10.0898 8.52014C10.0898 7.46627 10.9462 6.60999 12 6.60999Z" fill="#292D32" stroke="currentColor" />
                                <path d="M12 13.6C12.1339 13.6 12.25 13.7161 12.25 13.85C12.25 13.9882 12.1395 14.1 12 14.1C11.8605 14.1 11.75 13.9882 11.75 13.85C11.75 13.7161 11.8661 13.6 12 13.6Z" fill="currentColor" stroke="currentColor" />
                            </svg>
                        </div>
                        <div>
                            سوالات متداول
                        </div>
                    </Button> }
                </div>
            </div>

            <div className="relative md:col-span-5 lg:px-10 md:-mt-5">
                <img loading="lazy" fill src="/images/currency income.webp" alt="نقد کردن درآمد دلاری" className="w-full" />
            </div>

        </div>

    )
}
