import Button from "../../globals/Button";

export default function Empty() {
    return (
        <div className="grid justify-center text-center h-full mt-20">
            <div>
                <svg width="36" height="36" className="mx-auto" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M18.1152 32.264H7.9069C6.29607 32.264 4.99023 30.9582 4.99023 29.3473V6.014C4.99023 4.40317 6.29607 3.09734 7.9069 3.09734H25.4069C27.0177 3.09734 28.3236 4.40317 28.3236 6.014V14.764M28.6155 28.181L31.2405 30.806M21.0319 24.9723C21.0319 26.1327 21.4928 27.2455 22.3133 28.0659C23.1338 28.8864 24.2466 29.3473 25.4069 29.3473C26.5672 29.3473 27.68 28.8864 28.5005 28.0659C29.321 27.2455 29.7819 26.1327 29.7819 24.9723C29.7819 23.812 29.321 22.6992 28.5005 21.8787C27.68 21.0583 26.5672 20.5973 25.4069 20.5973C24.2466 20.5973 23.1338 21.0583 22.3133 21.8787C21.4928 22.6992 21.0319 23.812 21.0319 24.9723Z" stroke="#383838" stroke-width="2.5" stroke-linecap="round" stroke-linejoin="round" />
                </svg>
            </div>

            <div className="text-blue-custom text-3xl mt-1.5 font-bold">
                تیکتی ارسال نکردید!
            </div>

            <div className="text-sm mt-7 text-[#838383] max-w-96 mx-auto text-center">
                کاربر گرامی اول کارت چنانچه سوالی دارید می‌توانید با جستجو در قسمت سوالات متداول پاسخ اکثر سوالات خود را بیابید ، در صورتیکه به پاسخ مورد نظر خود دست نیافتید می‌توانید از طریق ارسال تیکت با کارشناسان اول کارت در ارتباط باشید.
            </div>

            <div className="flex gap-8 mt-7">
                <Button href="/panel/tickets/add" size="xl" flex className={'!rounded-[20px]'}>
                    <div>
                        <svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M3.61523 5.40051H9.61523M6.61523 2.40051V8.40051M14.6152 22.2209V15.4005H21.4356M13.6152 2.40051H19.6152C20.7198 2.40051 21.6152 3.29594 21.6152 4.40051V14.5721C21.6152 15.1025 21.4045 15.6112 21.0294 15.9863L15.201 21.8147C14.8259 22.1898 14.3172 22.4005 13.7868 22.4005H5.61523C4.51066 22.4005 3.61523 21.5051 3.61523 20.4005V12.4005" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>
                    </div>
                    <div>
                        ارسال تیکت پشتیبانی جدید
                    </div>
                </Button>
                <Button size="xl" flex className={'!rounded-[20px]'}>
                    <div>
                        <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M4.80566 13.9422V10.8172C4.80566 8.60705 5.68364 6.48744 7.24644 4.92463C8.80924 3.36183 10.9289 2.48386 13.139 2.48386C15.3491 2.48386 17.4688 3.36183 19.0316 4.92463C20.5944 6.48744 21.4723 8.60705 21.4723 10.8172V13.9422M4.80566 13.9422C4.80566 13.3897 5.02516 12.8598 5.41586 12.4691C5.80656 12.0783 6.33646 11.8589 6.889 11.8589H7.93066C8.4832 11.8589 9.0131 12.0783 9.4038 12.4691C9.7945 12.8598 10.014 13.3897 10.014 13.9422V17.0672C10.014 17.6197 9.7945 18.1496 9.4038 18.5403C9.0131 18.931 8.4832 19.1505 7.93066 19.1505H6.889C6.33646 19.1505 5.80656 18.931 5.41586 18.5403C5.02516 18.1496 4.80566 17.6197 4.80566 17.0672V13.9422ZM21.4723 13.9422C21.4723 13.3897 21.2528 12.8598 20.8621 12.4691C20.4714 12.0783 19.9415 11.8589 19.389 11.8589H18.3473C17.7948 11.8589 17.2649 12.0783 16.8742 12.4691C16.4835 12.8598 16.264 13.3897 16.264 13.9422V17.0672C16.264 17.6197 16.4835 18.1496 16.8742 18.5403C17.2649 18.931 17.7948 19.1505 18.3473 19.1505H19.389M21.4723 13.9422V17.0672C21.4723 17.6197 21.2528 18.1496 20.8621 18.5403C20.4714 18.931 19.9415 19.1505 19.389 19.1505M19.389 19.1505C19.389 20.8766 16.5911 22.2755 13.139 22.2755" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>
                    </div>
                    <div>
                        سوالات متداول
                    </div>
                </Button>
            </div>
        </div>
    );
}